p2000t/M2000/src/Allegro/Main.c
int CopyFile(ALLEGRO_PATH *sourceFolder, const char * filename, ALLEGRO_PATH *destinationFolder) 
{
  if (!al_make_directory(al_path_cstr(destinationFolder, PATH_SEPARATOR))) return 1;

  al_set_path_filename(sourceFolder, filename);
  al_set_path_filename(destinationFolder, filename);
  const char * sourceFile = al_path_cstr(sourceFolder, PATH_SEPARATOR);
  const char * destFile = al_path_cstr(destinationFolder, PATH_SEPARATOR);
  al_set_path_filename(sourceFolder, NULL);
  al_set_path_filename(destinationFolder, NULL);
  if (!al_filename_exists(sourceFile)) {
    if (Verbose) printf("[CopyFile] SourceFile %s does not exist\n", sourceFile);
    return 1;
  }
  if (al_filename_exists(destFile)) {
    if (Verbose) printf("[CopyFile] DestFile %s already exists\n", destFile);
    return 0;
  }

  if (Verbose) printf("[CopyFile] Copying %s to %s ...", sourceFile, destFile);
  FILE *f_s;
  FILE *f_d;
  char buf[1024];
  size_t size;
  int ret = 1;
  if ((f_s = fopen(sourceFile, "rb"))) {
    if ((f_d = fopen(destFile, "wb"))) {
      while ((size = fread(buf, 1, 1024, f_s)))
        fwrite(buf, 1, size, f_d);
      fclose(f_d);
      ret = 0;
    }
    fclose(f_s);
  }
  if (Verbose) puts(ret ? "FAILED" : "OK");
  return ret;
}

void InitDocumentFolders() 
{
  int i;
  ALLEGRO_PATH *resourcePath = al_get_standard_path(ALLEGRO_RESOURCES_PATH);
  // debian install check
  if (!strcmp(al_path_cstr(resourcePath, PATH_SEPARATOR), "/usr/bin/"))
    resourcePath = al_create_path_for_directory("/usr/share/M2000/");

  CopyFile(resourcePath, "README.md", docPath);
  al_set_path_filename(docPath, NULL);

  al_append_path_component((userCassettesPath = al_clone_path(docPath)), "Cassettes");
  if (!al_filename_exists(al_path_cstr(userCassettesPath, PATH_SEPARATOR)))
    for (i=0; installCassettes[i]; i++)
      CopyFile(resourcePath, installCassettes[i], userCassettesPath);

  al_append_path_component((userCartridgesPath = al_clone_path(docPath)), "Cartridges");
  if (!al_filename_exists(al_path_cstr(userCartridgesPath, PATH_SEPARATOR)))
    for (i=0; installCartridges[i]; i++)
      CopyFile(resourcePath, installCartridges[i], userCartridgesPath);

  al_append_path_component((userScreenshotsPath = al_clone_path(docPath)), "Screenshots");
  al_make_directory(al_path_cstr(userScreenshotsPath, PATH_SEPARATOR));

  al_append_path_component((userVideoRamDumpsPath = al_clone_path(docPath)), "VideoRAM dumps");
  al_make_directory(al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR));

  al_append_path_component((userStateSnapshotsPath= al_clone_path(docPath)), "State snapshots");
  al_make_directory(al_path_cstr(userStateSnapshotsPath, PATH_SEPARATOR));

  al_destroy_path(resourcePath);
}

/****************************************************************************/
/*** Initialise all resources needed by the Linux/SVGALib implementation  ***/
/****************************************************************************/
int InitMachine(void)
{
  int startFullScreen = (videomode == FULLSCREEN_VIDEO_MODE);

  if (TapeName) 
    currentTapePath = al_create_path(TapeName);

  /* get primary display monitor info */
  for (int i=0; i<al_get_num_video_adapters(); i++) {
    if (al_get_monitor_info(i, &monitorInfo) && monitorInfo.x1 == 0 && monitorInfo.y1 == 0) {
      if (Verbose) printf("Primary fullscreen display: %i x %i\n", monitorInfo.x2 - monitorInfo.x1, monitorInfo.y2 - monitorInfo.y1);
      break; //primary display found
    }
  }

  InitDocumentFolders();

  cassetteChooser = al_create_native_file_dialog(userCassettesPath ? al_path_cstr(userCassettesPath, PATH_SEPARATOR) : NULL,
    _(DIALOG_LOAD_CASSETTE), "*.*", 0); //file doesn't have to exist
  cartridgeChooser = al_create_native_file_dialog(userCartridgesPath ? al_path_cstr(userCartridgesPath, PATH_SEPARATOR) : NULL,
    _(DIALOG_LOAD_CARTRIDGE), "*.bin", ALLEGRO_FILECHOOSER_FILE_MUST_EXIST);
  screenshotChooser = al_create_native_file_dialog(userScreenshotsPath ? al_path_cstr(userScreenshotsPath, PATH_SEPARATOR) : NULL,
    _(DIALOG_SAVE_SCREENSHOT),  "*.png;*.bmp", ALLEGRO_FILECHOOSER_SAVE);
  vRamLoadChooser = al_create_native_file_dialog(userVideoRamDumpsPath ? al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR) : NULL,
    _(DIALOG_LOAD_VRAM),  "*.vram", ALLEGRO_FILECHOOSER_FILE_MUST_EXIST);
  vRamSaveChooser = al_create_native_file_dialog(userVideoRamDumpsPath ? al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR) : NULL,
    _(DIALOG_SAVE_VRAM),  "*.vram", ALLEGRO_FILECHOOSER_SAVE);
  stateLoadChooser = al_create_native_file_dialog(userStateSnapshotsPath ? al_path_cstr(userStateSnapshotsPath, PATH_SEPARATOR) : NULL,
    _(DIALOG_LOAD_STATE),  "*.dmp", ALLEGRO_FILECHOOSER_FILE_MUST_EXIST);
  stateSaveChooser = al_create_native_file_dialog(userStateSnapshotsPath ? al_path_cstr(userStateSnapshotsPath, PATH_SEPARATOR) : NULL,
    _(DIALOG_SAVE_STATE),  "*.dmp", ALLEGRO_FILECHOOSER_SAVE);

  if (Verbose) printf("Initialising and detecting joystick... ");
  joyDetected=0; //assume not found
  if (al_install_joystick()) {
    if ((joystick = al_get_joystick(0)) != NULL) {
      joyDetected = 1;
      if (Verbose) puts("OK");
    }
  }
  if (!joyDetected && Verbose) puts("FAILED");

  if (Verbose) printf("Creating the display window... ");
  InitVideoMode();
  UpdateDisplaySettings();
#ifdef __linux__
  al_set_new_display_flags (ALLEGRO_WINDOWED | ALLEGRO_GTK_TOPLEVEL); // ALLEGRO_GTK_TOPLEVEL required for menu in Linux
#else
  al_set_new_display_flags (ALLEGRO_WINDOWED);
#endif
  al_set_new_display_option(ALLEGRO_SINGLE_BUFFER, 1, ALLEGRO_REQUIRE); //require single buffer
#ifdef __linux__
  // for Linux create smallest display, as it does not correctly scale back
  if ((display = al_create_display(Displays[1][0], Displays[1][1])) == NULL)
#else
  if ((display = al_create_display(DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder)) == NULL)
#endif
    return ReturnErrorMessage("Could not initialize display.");

  if (Verbose) puts("OK");

  if (Verbose) printf("Creating timer and queues... ");
  eventQueue = al_create_event_queue();
  timerQueue =  al_create_event_queue();
  timer = al_create_timer(1.0 / IFreq);
  if (!eventQueue || !timerQueue || !timer)
    return ReturnErrorMessage("Could not initialize timer and event queues.");
  if (Verbose) puts("OK");

  UpdateWindowTitle();

#ifdef _WIN32
  // Set app icon. Only for Windows, as macOS uses its own app package icons
  // and Linux doesn't support al_set_display_icon when using a menu.
  ALLEGRO_FILE *iconFile;
  if ((iconFile = al_open_memfile(p2000icon_png, p2000icon_png_len, "r")) != NULL) {
    ALLEGRO_BITMAP *bm = al_load_bitmap_f(iconFile, ".png");
    al_set_display_icon(display, bm);
    al_fclose(iconFile);
    al_destroy_bitmap(bm);
  }
#endif

  al_register_event_source(eventQueue, al_get_display_event_source(display));
  //al_register_event_source(eventQueue, al_get_keyboard_event_source());
  al_register_event_source(eventQueue, al_get_default_menu_event_source());
  al_register_event_source(timerQueue, al_get_timer_event_source(timer));

  if (P2000_Mode) { /* M-mode uses black and white palette */
    Pal[0] = Pal[1] = Pal[2] = 0;
    Pal[3] = Pal[4] = Pal[5] = 255;
  }

  if (Verbose) printf("  Allocating cache buffers... ");
  OldCharacter = malloc(80 * 24 * sizeof(int));
  if (!OldCharacter) return ReturnErrorMessage("Could not allocate character buffer.");
  ClearScreen();
  if (Verbose) puts("OK");

  /* sound init */
  if (Verbose) printf("Initializing sound...");
  soundDetected = al_install_audio() && al_reserve_samples(0);
  if (Verbose) puts(soundDetected ? "OK" :"FAILED");
  ResetAudioStream();

  // create menu
  if (Verbose) printf("Creating menu...");
  CreateEmulatorMenu();
#ifdef _WIN32
  menubarHeight = al_get_display_height(display) - DisplayHeight - 2*DisplayVBorder;
#endif
#if defined(_WIN32) || defined(__linux__)
  // resize display after menu was attached
  al_resize_display(display, DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder -menubarHeight);
#endif

  if (Verbose) puts(menu ? "OK" : "FAILED");

  if (startFullScreen)
    ToggleFullscreen();

  /* start the 50Hz/60Hz timer */
  al_start_timer(timer);

  return 1;
}

